Pandas

Series are used to work with one dimensional array, whereas DataFrame can be used with two dimensional arrays. DataFrame has two different index i.e.column-index and row-index.

In [12]:
import pandas as pd

#converting tuple to series
tuple_data = ('aasai',23,'Engineer','Korea')
series = pd.Series(tuple_data,index=['name','age','profession','Loaction'])
print(series)
type(series)

name             aasai
age                 23
profession    Engineer
Loaction         Korea
dtype: object

pandas.core.series.Series

In [6]:
#converting dictionary to series

dict_data = {'name':'aasai','age':23,'Profession':'Engineer','Location':'Korea'}
series = pd.Series(dict_data)
print(series)
type(series)

name             aasai
age                 23
Profession    Engineer
Location         Korea
dtype: object

pandas.core.series.Series

In [29]:
#Elements of the Series can be accessed using index name e.g. f[‘shares’] or f[0]

dict_data['name']
tuple_data[0]

'aasai'

In [32]:
data = {'name':['aasai','praveen','nanda'],
       'age':[23,23,23],
       'Profession':['Engineer','Engineer','Engineer'],
       'native':['Coimbatore','Mayavaram','Thiruvallur']
       }
Data_frame = pd.DataFrame(data,index=['one','two','three'])
print(Data_frame)

          name  age Profession       native
one      aasai   23   Engineer   Coimbatore
two    praveen   23   Engineer    Mayavaram
three    nanda   23   Engineer  Thiruvallur

In [33]:
type(Data_frame)

pandas.core.frame.DataFrame

In [35]:
#Added Additional Column
Data_frame['country'] = ['India','India','India']
print(Data_frame)

          name  age Profession       native country
one      aasai   23   Engineer   Coimbatore   India
two    praveen   23   Engineer    Mayavaram   India
three    nanda   23   Engineer  Thiruvallur   India

In [46]:
#.loc for label based indexing or
#.iloc for positional indexing
Data_frame.loc['one']
Data_frame.iloc[0]

name               aasai
age                   23
Profession      Engineer
native        Coimbatore
country            India
Name: one, dtype: object

In [53]:
#All rows and first column access
Data_frame.iloc[:,0]
Data_frame.loc[:,'name']

one        aasai
two      praveen
three      nanda
Name: name, dtype: object

In [49]:
#All column and First row access
Data_frame.iloc[0,:]
Data_frame.loc['one',:]

name               aasai
age                   23
Profession      Engineer
native        Coimbatore
country            India
Name: one, dtype: object

In [57]:
#Access first row and third column syntax for accessing specific data
Data_frame.iloc[0,2]
#output : Engineer
Data_frame.loc['one','age']

23

In [58]:
#delete Profession column usingg del command
del Data_frame['Profession']
Data_frame

          name  age       native country
one      aasai   23   Coimbatore   India
two    praveen   23    Mayavaram   India
three    nanda   23  Thiruvallur   India

In [80]:
#Replace Aasai native to madurai using replace
Data_frame.replace(to_replace = 'Coimbatore',value = 'Madurai')
#Replace using location
Data_frame.loc['one','native'] = 'Madurai'
Data_frame

          name  age       native country
one      aasai   23      Madurai   India
two    praveen   23    Mayavaram   India
three    nanda   23  Thiruvallur   India

In [88]:
#Creating a Series by passing a list of values and set index by series of date
series = pd.Series(['one','Two','Three'],index = pd.date_range('20191101',periods=3))
series

2019-11-01      one
2019-11-02      Two
2019-11-03    Three
Freq: D, dtype: object

In [90]:
#create dataframe using numpy
import numpy as np
data_frame = pd.DataFrame(np.random.randn(6,4),index = pd.date_range('20191101',periods = 6))
data_frame

                   0         1         2         3
2019-11-01  0.596539 -0.712745  2.981427 -0.320373
2019-11-02  1.413271 -0.748839  1.415216 -0.436360
2019-11-03 -0.356902  0.050044 -0.585696  1.437954
2019-11-04 -1.296200 -1.219660  0.532947 -0.543326
2019-11-05 -0.075037 -2.293043 -0.056860  0.806413
2019-11-06 -1.192664  0.965489  1.207226  0.754615

In [95]:
#column name added
data_frame = pd.DataFrame(np.random.randn(6,4),index = pd.date_range('20191101',periods = 6),columns = ['a','b','c','d'])
data_frame

                   a         b         c         d
2019-11-01  0.024194  1.443655 -0.916189  0.631278
2019-11-02 -0.230816 -0.038641 -1.140007 -0.134891
2019-11-03 -0.769798 -1.295400  1.412120 -0.131342
2019-11-04  0.812340  1.065062 -1.076679  2.257221
2019-11-05 -0.538890 -0.965087 -0.310730 -1.115317
2019-11-06 -0.599103 -0.766934 -0.659769 -0.027627